emacs/config.org
#+title: Emacs Configuration
#+author: 37
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* basics

#+begin_src emacs-lisp
;; This config generates itself from the config.org file
;; don't edit that file; edit config.org instead
#+end_src

Don't do backup and swap files

#+begin_src emacs-lisp
(setq make-backup-files nil)
(setq auto-save-default nil)
#+end_src

UTF-8 default for everything that is text

#+begin_src emacs-lisp
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
#+end_src

"Start page" is a org-mode scratch buffer

#+begin_src emacs-lisp
(setq inhibit-splash-screen t
      initial-scratch-message ""
      initial-major-mode 'org-mode)
#+end_src 


Window title is <file anme > <major mode>:

#+begin_src emacs-lisp
(setq-default frame-title-format '("%f [%m]"))
#+end_src

** use-package setup

Emacs has a built in package manager but it doesn't make it easy to automatically install packages on a new system the first time you pull down your configuration.  [[https://github.com/jwiegley/use-package][use-package]] is a really helpful package used in this configuration to make it a lot easier to automate the installation and configuration of everything else we use.

#+begin_src emacs-lisp

  ;; NOTE: init.el is now generated from Emacs.org.  Please edit that file
  ;;       in Emacs and init.el will be generated automatically!

  ;; Initialize package sources
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

    ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

#+end_src

* ui
** TODO a startify style start page (there is the dashbord package idk)
** basics 

Removing all the default UI elements and disabling line numbers in some modes.

#+begin_src emacs-lisp

   ;; (global-hl-line-mode +1)
   ;; (set-face-background 'hl-line "#333333")

   (setq inhibit-startup-message t)

   (scroll-bar-mode -1)        ; Disable visible scrollbar
   (tool-bar-mode -1)          ; Disable the toolbar
   (tooltip-mode -1)           ; Disable tooltips
   (set-fringe-mode 10)        ; Give some breathing room

   (menu-bar-mode -1)            ; Disable the menu bar

   (column-number-mode)
   (global-display-line-numbers-mode 1)
  ;; (global-linum-mode t)

   ;; Disable line numbers for some modes
   (dolist (mode '(org-mode-hook
                   deer-mode-hook
                   ranger-mode-hook
                   term-mode-hook
                   shell-mode-hook
                   meme-mode-hook
                   treemacs-mode-hook
                   neotree-mode-hook
                   eshell-mode-hook))
     (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

Make it resize arbitrarily (so it takes up all alocated space of a twm all the time).

#+begin_src emacs-lisp
(setq frame-resize-pixelwise t)
#+end_src

** padding

It do be looking better with padding.

#+begin_src emacs-lisp
;; callback on all open frames
(defun ns/apply-frames (action)
  (interactive)
  (mapc (lambda (frame)
          (funcall action frame)
          (redraw-frame frame))
    (frame-list)))

(setq-default
 delete-by-moving-to-trash t                      ; Delete files to trash
 window-combination-resize t                      ; take new window space from al other windows (not just current)
 x-stretch-cursor t)                              ; Stretch cursor to the glyph width

(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
;; evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
 auto-save-default t                         ; Nobody likes to loose work, I certainly don't
 truncate-string-ellipsis "…")               ; Unicode ellispis are nicer than "...", and also save /precious/ space


(defun ns/frame-set-parameter (key value)
  "set a value on all current and future frames"
  (interactive)
  ;; current:
  (ns/apply-frames (lambda (k) (set-frame-parameter k key value)))

  ;; future:
  (setq default-frame-alist
        (assq-delete-all key default-frame-alist))

  (add-to-list 'default-frame-alist `(,key . ,value)))


(ns/frame-set-parameter 'internal-border-width 40)
#+end_src 

** font 

Using JetBrains Mono Nerd Font here.

#+begin_src emacs-lisp

;; You will most likely need to adjust this font size for your system!
(defvar efs/default-font-size 100)
(defvar efs/default-variable-font-size 100)

(set-face-attribute 'default nil :font "JetBrains Mono Nerd Font" :height efs/default-font-size)

;; Set the fixed pitch face
(set-face-attribute 'fixed-pitch nil :font "JetBrains Mono Nerd Font" :height efs/default-font-size)

;; Set the variable pitch face
(set-face-attribute 'variable-pitch nil :font "JetBrains Mono Nerd Font" :height efs/default-variable-font-size :weight 'regular)

#+end_src

** theme

[[https://github.com/hlissner/emacs-doom-themes][doom-themes]] is a great set of themes with a lot of variety and support for many different Emacs modes.  Taking a look at the [[https://github.com/hlissner/emacs-doom-themes/tree/screenshots][screenshots]] might help you decide which one you like best.  You can also run =M-x counsel-load-theme= to choose between them easily.

#+begin_src emacs-lisp

(use-package doom-themes
  :init (load-theme 'doom-mine t))

#+end_src

** scroll 

The conservative scrolling with margin that I'm used to from VIM. Kinda glitchy when I'm at the end of a file and scrolling up.

#+begin_src emacs-lisp
(custom-set-variables
  '(scroll-conservatively 1000)
  '(scroll-margin 9)
)
#+end_src

** statusbar 

Just using doom statusbar here.

#+begin_src emacs-lisp

(use-package all-the-icons)

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))

;; show some other usefull stuff
(setq doom-modeline-major-mode-icon t)
(setq doom-modeline-lsp t)

#+end_src

** Ivy and Counsel

#+begin_src emacs-lisp

  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))

  (use-package counsel
    :bind (("C-M-j" . 'counsel-switch-buffer)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :custom
    (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
    :config
    (counsel-mode 1))

#+end_src

** Helpful Help Commands

#+begin_src emacs-lisp

  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

** text scale toggle keybind

#+begin_src emacs-lisp

  (use-package hydra)

  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

#+end_src

** dired

Make it ranger-like:

#+begin_src emacs-lisp
(use-package ranger)
(ranger-override-dired-mode t)
(setq ranger-parent-depth 1)
(setq ranger-width-parents 0.12)
(setq ranger-max-parent-width 0.12)
(setq ranger-preview-file t)
(setq ranger-width-preview 0.55)
(dolist (mode '(deer-mode-hook))
    (add-hook mode () (ranger-minimal-toggle)))
#+end_src

* others
** discord

#+begin_src emacs-lisp
(use-package elcord)
#+end_src

** neotree 

Load neotree, add toggle keybind, use colorschemes colors for the icons.

#+begin_src emacs-lisp
(use-package neotree)
(setq neo-theme (if (display-graphic-p) 'icons 'arrow))
#+end_src

** emojify

Emoji picker 😉 

#+begin_src emacs-lisp
(use-package emojify)
  ;; :hook (after-init . global-emojify-mode))
#+end_src 

** memes

#+begin_src emacs-lisp
(add-to-list 'load-path "~/.emacs.d/meme")
(require 'meme)
(autoload 'meme "meme.el" "Create a meme from a collection" t)
(autoload 'meme-file "meme.el" "Create a meme from a file" t)
#+end_src

"Start page" is a org-mode scratch buffer

#+begin_src emacs-lisp
(setq inhibit-splash-screen t
      initial-scratch-message ""
      initial-major-mode 'org-mode)
#+end_src 

