emacs/init.el
;; This config generates itself from the config.org file
;; don't edit that file; edit config.org instead

(setq make-backup-files nil)
(setq auto-save-default nil)

(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)

(setq inhibit-splash-screen t
      initial-scratch-message ""
      initial-major-mode 'org-mode)

(setq-default frame-title-format '("%f [%m]"))

;; NOTE: init.el is now generated from Emacs.org.  Please edit that file
;;       in Emacs and init.el will be generated automatically!

;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

;; (global-hl-line-mode +1)
 ;; (set-face-background 'hl-line "#333333")

 (setq inhibit-startup-message t)

 (scroll-bar-mode -1)        ; Disable visible scrollbar
 (tool-bar-mode -1)          ; Disable the toolbar
 (tooltip-mode -1)           ; Disable tooltips
 (set-fringe-mode 10)        ; Give some breathing room

 (menu-bar-mode -1)            ; Disable the menu bar

 (column-number-mode)
 (global-display-line-numbers-mode 1)
;; (global-linum-mode t)

 ;; Disable line numbers for some modes
 (dolist (mode '(org-mode-hook
                 deer-mode-hook
                 ranger-mode-hook
                 term-mode-hook
                 shell-mode-hook
                 meme-mode-hook
                 treemacs-mode-hook
                 neotree-mode-hook
                 eshell-mode-hook))
   (add-hook mode (lambda () (display-line-numbers-mode 0))))

(setq frame-resize-pixelwise t)

;; callback on all open frames
(defun ns/apply-frames (action)
  (interactive)
  (mapc (lambda (frame)
          (funcall action frame)
          (redraw-frame frame))
    (frame-list)))

(setq-default
 delete-by-moving-to-trash t                      ; Delete files to trash
 window-combination-resize t                      ; take new window space from al other windows (not just current)
 x-stretch-cursor t)                              ; Stretch cursor to the glyph width

(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
;; evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
 auto-save-default t                         ; Nobody likes to loose work, I certainly don't
 truncate-string-ellipsis "…")               ; Unicode ellispis are nicer than "...", and also save /precious/ space


(defun ns/frame-set-parameter (key value)
  "set a value on all current and future frames"
  (interactive)
  ;; current:
  (ns/apply-frames (lambda (k) (set-frame-parameter k key value)))

  ;; future:
  (setq default-frame-alist
        (assq-delete-all key default-frame-alist))

  (add-to-list 'default-frame-alist `(,key . ,value)))


(ns/frame-set-parameter 'internal-border-width 40)

;; You will most likely need to adjust this font size for your system!
(defvar efs/default-font-size 100)
(defvar efs/default-variable-font-size 100)

(set-face-attribute 'default nil :font "JetBrains Mono Nerd Font" :height efs/default-font-size)

;; Set the fixed pitch face
(set-face-attribute 'fixed-pitch nil :font "JetBrains Mono Nerd Font" :height efs/default-font-size)

;; Set the variable pitch face
(set-face-attribute 'variable-pitch nil :font "JetBrains Mono Nerd Font" :height efs/default-variable-font-size :weight 'regular)

(use-package doom-themes
  :init (load-theme 'doom-mine t))

(custom-set-variables
  '(scroll-conservatively 1000)
  '(scroll-margin 9)
)

(use-package all-the-icons)

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))

;; show some other usefull stuff
(setq doom-modeline-major-mode-icon t)
(setq doom-modeline-lsp t)

(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))

(use-package ivy-rich
  :init
  (ivy-rich-mode 1))

(use-package counsel
  :bind (("C-M-j" . 'counsel-switch-buffer)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history))
  :custom
  (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
  :config
  (counsel-mode 1))

(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(use-package hydra)

(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))

(use-package ranger)
(ranger-override-dired-mode t)
(setq ranger-parent-depth 1)
(setq ranger-width-parents 0.12)
(setq ranger-max-parent-width 0.12)
(setq ranger-preview-file t)
(setq ranger-width-preview 0.55)
(dolist (mode '(deer-mode-hook))
    (add-hook mode () (ranger-minimal-toggle)))

(use-package elcord)

(use-package neotree)
(setq neo-theme (if (display-graphic-p) 'icons 'arrow))

(use-package emojify)
  ;; :hook (after-init . global-emojify-mode))

(add-to-list 'load-path "~/.emacs.d/meme")
(require 'meme)
(autoload 'meme "meme.el" "Create a meme from a collection" t)
(autoload 'meme-file "meme.el" "Create a meme from a file" t)

(setq inhibit-splash-screen t
      initial-scratch-message ""
      initial-major-mode 'org-mode)
