emacs/config.org
** undotree 

Should probably look up how to actually use that thing.

#+begin_src emacs-lisp
;;(use-package undo-tree
;;  :config
;;  (global-undo-tree-mode t)
;;  (setq undo-tree-auto-save-history t)
;;  (push '("." . "~/.emacs.d/undo-tree-history") undo-tree-history-directory-alist))
#+end_src

** color preview

#+begin_src emacs-lisp
(use-package rainbow-mode
  :hook (after-init . rainbow-mode))
#+end_src

* keys
** general

#+begin_src emacs-lisp

  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  
  ;; just to quickly get to the emacs config
  (global-set-key (kbd "<f5>") (lambda() (interactive)(find-file "~/.emacs.d/config.org")))

  (use-package general
    :config
    (general-create-definer namba/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")

    (namba/leader-keys
      "t"  '(:ignore t :which-key "toggles")
      "tr" '(rainbow-delimiters-mode :which-key "toggle rainbow delimiters mode")
      "td" '(elcord-mode :which-key "toggle discord thingy")
      "tl" '(:ignore t :which-key "line number toggling")
      "tlr" '(menu-bar--display-line-numbers-mode-relative :which-key "enable relative line numbers")
      "tla" '(menu-bar--display-line-numbers-mode-absolute :which-key "enable relative line numbers")
      "tld" '(display-line-numbers-mode :which-key "enable relative line numbers")
      "c" '(:ignore t :which-key "programming stuff")
      "cf" '(yafolding-toggle-element :which-key "toggle folding element")
      "ca" '(yafolding-toggle-all :which-key "toggle folding all")
      "tt" '(counsel-load-theme :which-key "choose theme")
      "tn" '(neotree-toggle :which-key "toggles neotree")
      "ts" '(hydra-text-scale/body :which-key "scale text"))
    (namba/leader-keys
      "o"  '(:ignore t :which-key "open")
      "ob" '(switch-to-buffer :which-key "switch buffer")
      "od" '(dired :which-key "open dired")
      "oo" '(org-agenda :which-key "open dired")
      "om" '(meme :which-key "open meme generator")
      "os" '(shell :which-key "open shell"))
    (namba/leader-keys
      "i"  '(:ignore t :which-key "insert")
      "it" '(org-insert-structure-template :which-key "insert structure template")
      "ie" '(emojify-insert-emoji :which-key "insert emojis")))

    (namba/leader-keys
      "l"  '(:ignore t :which-key "latex")
      "ll" '(org-latex-preview :which-key "toggle latex preview")
      "lp" '(latex-preview-update :which-key "show rendered PDF")
      "la" '(TeX-command-run-all :which-key "render as PDF"))

    (namba/leader-keys
      "m"  '(evilnc-comment-or-uncomment-lines :which-key "(un-)comment lines"))
#+end_src

** evil mode

The evil package adds vim keybindings.

#+begin_src emacs-lisp
(setq evil-want-keybindings nil)
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
	(setq evil-want-fine-undo 'fine)
	(setq evil-undo-system 'undo-tree)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-org
  :after org
  :config
  (add-hook 'org-mode-hook 'evil-org-mode)
  (add-hook 'evil-org-mode-hook 'evil-org-set-key-theme)
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

(use-package evil-surround
	:after evil
	:config
	(global-evil-surround-mode t))

#+end_src

** which key

To always know what key to press next.

#+begin_src emacs-lisp

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1))

#+end_src

* latex 

Everything latex related goes in here.

#+begin_src emacs-lisp
(use-package auctex-latexmk
  :ensure t
  :config
  (auctex-latexmk-setup)
  (setq auctex-latexmk-inherit-TeX-PDF-mode t))

(use-package tex
  :ensure auctex
  :mode ("\\.tex\\'" . latex-mode)
  :config (progn
	    (setq TeX-source-correlate-mode t)
	    (setq TeX-source-correlate-method 'synctex)
	    (setq TeX-auto-save t)
	    (setq TeX-parse-self t)
	    ;;    (setq-default TeX-master "paper.tex")
	    (setq reftex-plug-into-AUCTeX t)
	    ;;(setq TeX-view-program-selection '((output-pdf "zathura"))
	    ;;    TeX-source-correlate-start-server t)
	    ;; Update PDF buffers after successful LaTeX runs
	    (add-hook 'TeX-after-compilation-finished-functions
		      #'TeX-revert-document-buffer)
	    (add-hook 'LaTeX-mode-hook
		      (lambda ()
			(reftex-mode t)
			(flyspell-mode t)))
	    ))
#+end_src

#+begin_src emacs-lisp

(use-package auctex
  :defer t
  :ensure t
  :config
  (setq TeX-auto-save t))

#+end_src

* org mode
