emacs/config.org
** website export

Tinkered a little with that. Don't know how to add static elements yet

#+begin_src emacs-lisp
;;
;;  (defun org-blog-prepare (project-plist)
;;    "With help from `https://github.com/howardabrams/dot-files'.
;;    Touch `index.org' to rebuilt it.
;;    Argument `PROJECT-PLIST' contains information about the current project."
;;    (let* ((base-directory (plist-get project-plist :base-directory))
;;           (buffer (find-file-noselect (expand-file-name "index.org" base-directory) t)))
;;      (with-current-buffer buffer
;;        (set-buffer-modified-p t)
;;        (save-buffer 0))
;;      (kill-buffer buffer)))
;;
;;  (defvar org-blog-head
;;    "<link rel=\"stylesheet\" type=\"text/css\" href=\"/assets/css/bootstrap.css\"/>
;;    <link rel=\"stylesheet\" type=\"text/css\" href=\"https://fonts.googleapis.com/css?family=Amaranth|Handlee|Libre+Baskerville|Bree+Serif|Ubuntu+Mono|Pacifico&subset=latin,greek\"/>
;;    <link rel=\"shortcut icon\" type=\"image/x-icon\" href=\"favicon.ico\">")
;;
;;  (defun org-blog-preamble (_plist)
;;    "Pre-amble for whole blog."
;;    "<div class=\"banner\">
;;      <a href=\"/\"> Ramblings from a Corner </a>
;;    </div>
;;    <ul class=\"banner-links\">
;;      <li><a href=\"/\"> About Me </a> </li>
;;      <li><a href=\"/archive.html\"> Posts </a> </li>
;;    </ul>
;;    <hr>")
;;
;;  (defun org-blog-postamble (plist)
;;    "Post-amble for whole blog."
;;    (concat
;;    "<footer class=\"footer\">
;;        <!-- Footer Definition -->
;;     </footer>
;;
;;    <!-- Google Analytics Js -->"
;;
;;     ;; Add Disqus if it's a post
;;     (when (s-contains-p "/posts/" (plist-get plist :input-file))
;;     "<!-- Disqua JS --> ")))
;;
;;  (defun org-blog-sitemap-format-entry (entry _style project)
;;    "Return string for each ENTRY in PROJECT."
;;    (when (s-starts-with-p "posts/" entry)
;;      (format "@@html:<span class=\"archive-item\"><span class=\"archive-date\">@@ %s @@html:</span>@@ [[file:%s][%s]] @@html:</span>@@"
;;              (format-time-string "%h %d, %Y"
;;                                  (org-publish-find-date entry project))
;;              entry
;;              (org-publish-find-title entry project))))
;;
;;  (defun org-blog-sitemap-function (title list)
;;    "Return sitemap using TITLE and LIST returned by `org-blog-sitemap-format-entry'."
;;    (concat "#+TITLE: " title "\n\n"
;;            "\n#+begin_archive\n"
;;            (mapconcat (lambda (li)
;;                         (format "@@html:<li>@@ %s @@html:</li>@@" (car li)))
;;                       (seq-filter #'car (cdr list))
;;                       "\n")
;;            "\n#+end_archive\n"))
;;
;;  (defun org-blog-publish-to-html (plist filename pub-dir)
;;    "Same as `org-html-publish-to-html' but modifies html before finishing."
;;    (let ((file-path (org-html-publish-to-html plist filename pub-dir)))
;;      (with-current-buffer (find-file-noselect file-path)
;;        (goto-char (point-min))
;;        (search-forward "<body>")
;;        (insert (concat "\n<div class=\"content-wrapper container\">\n "
;;                        "  <div class=\"row\"> <div class=\"col\"> </div> "
;;                        "  <div class=\"col-sm-6 col-md-8\"> "))
;;        (goto-char (point-max))
;;        (search-backward "</body>")
;;        (insert "\n</div>\n<div class=\"col\"></div></div>\n</div>\n")
;;        (save-buffer)
;;        (kill-buffer))
;;      file-path))
;;
;;  (setq org-publish-project-alist
;;        `(("orgfiles"
;;           :base-directory "~/test/"
;;           :exclude ".*drafts/.*"
;;           :base-extension "org"
;;
;;           :publishing-directory "~/test/"
;;
;;           :recursive t
;;           :preparation-function org-blog-prepare
;;           :publishing-function org-blog-publish-to-html
;;
;;           :with-toc nil
;;           :with-title t
;;           :with-date t
;;           :section-numbers nil
;;           :html-doctype "html5"
;;           :html-html5-fancy t
;;           :html-head-include-default-style nil
;;           :html-head-include-scripts nil
;;           :htmlized-source t
;;           :html-head-extra ,org-blog-head
;;           :html-preamble org-blog-preamble
;;           :html-postamble org-blog-postamble
;;
;;           :auto-sitemap t
;;           :sitemap-filename "archive.org"
;;           :sitemap-title "Blog Posts"
;;           :sitemap-style list
;;           :sitemap-sort-files anti-chronologically
;;           :sitemap-format-entry org-blog-sitemap-format-entry
;;           :sitemap-function org-blog-sitemap-function)
;;
;;          ("assets"
;;           :base-directory "~/test/src/assets/"
;;           :base-extension ".*"
;;           :publishing-directory "~/test/assets/"
;;           :publishing-function org-publish-attachment
;;           :recursive t)
;;
;;          ;; ("rss"
;;          ;;  :base-directory "~/test/src/"
;;          ;;  :base-extension "org"
;;          ;;  :html-link-home "https://vicarie.in/"
;;          ;;  :html-link-use-abs-url t
;;          ;;  :rss-extension "xml"
;;          ;;  :publishing-directory "~/test/"
;;          ;;  :publishing-function (org-rss-publish-to-rss)
;;          ;;  :exclude ".*"
;;          ;;  :include ("archive.org")
;;          ;;  :section-numbers nil
;;          ;;  :table-of-contents nil)
;;
;;          ("blog" :components ("orgfiles" "assets" "rss"))))
#+end_src

#+begin_src emacs-lisp
(use-package htmlize)
#+end_src

** Better Font Faces

#+begin_src emacs-lisp

  (defun efs/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

#+end_src

